//****************** File Icr00A6.h ***********************
//
//  ќпределени€ констант и структур 
//	дл€ работы с конфигурационным ѕѕ«”
//  дл€ субмодулей FM112x2G6DA 
//
//*********************************************************

#ifndef _ICR00A6_H
 #define _ICR00A6_H

#pragma pack(push, 1)    

#define ADM_CFG_TAG 0x00A6

//  онфигурационные параметры субмодул€
typedef struct _ICR_Cfg00A6 {
	U16	wTag;		// тэг структуры (ADM_CFG_TAG)
	U16	wSize;		// размер всех следующих полей структуры
	U08	bAdmIfNum;	// номер интерфейса ADM
	U08	bAdcCnt;	// количество ј÷ѕ: 0, 1
	U08	bDacCnt;	// количество ÷јѕ: 0, 1
	U08	reserve;	// 

	U32	nClkLoBand;	// нижн€€ частота полосы такта (к√ц)
	U32	nClkHiBand;	// верхн€€ частота полосы такта (к√ц)
	U32	nGenRef;    // частота внутр. генератора (к√ц)
	U32	nAdcLoBand;	// нижн€€ частота полосы ј÷ѕ (к√ц)
	U32	nAdcHiBand;	// верхн€€ частота полосы ј÷ѕ (к√ц)
	U32	nDacLoBand;	// нижн€€ частота полосы ÷јѕ (к√ц)
	U32	nDacHiBand;	// верхн€€ частота полосы ÷јѕ (к√ц)

	U08	bInpType;		// тип входа ј÷ѕ: 0-трансформатор, 1-усилитель
	U08	bAdcType;		// тип кристалла ј÷ѕ: 0-нет, 1-AD9625-2.0, 2-AD9625-2.5, 3-AD9625-2.6, 
	U08	bDacType;		// тип кристалла ÷јѕ: 0-нет, 1-AD9164
	U08	bPllType;		// тип кристалла PLL: 0-нет, 1-LMX2592

	U32	nAdcBitrateMin;	// минимальный битрейт кристалла ј÷ѕ (мегабит/сек)
	U32	nAdcBitrateMax;	// максимальный битрейт кристалла ј÷ѕ (мегабит/сек)
	U32	nDacBitrateMin;	// минимальный битрейт кристалла ÷јѕ (мегабит/сек)
	U32	nDacBitrateMax;	// максимальный битрейт кристалла ÷јѕ (мегабит/сек)
	U16	wThdacRange;	// шкала преобразовани€ ÷јѕ-»ѕЌ (м¬)

} ICR_Cfg00A6, *PICR_Cfg00A6, ICR_CfgAdm, *PICR_CfgAdm;

#pragma pack(pop)    

#endif // _ICR00A6_H

// ****************** End of file Icr00A6.h **********************
