//****************** File Icr0093.h ***********************
//
//  Определения констант и структур 
//	для работы с конфигурационным ППЗУ
//  для субмодулей FM814x125M
//
//*********************************************************

#ifndef _ICR0093_H
 #define _ICR0093_H

#pragma pack(push, 1)    

#define ADM_CFG_TAG 0x0093

// Конфигурационные параметры субмодуля
typedef struct _ICR_Cfg0093 {
	U16	wTag;		// тэг структуры (ADM_CFG_TAG)
	U16	wSize;		// размер всех следующих полей структуры
	U08	bAdmIfNum;	// номер интерфейса ADM
	U08	bAdcCnt;	// количество АЦП: 4, 8
	U08	bAdcType;	// тип кристалла АЦП: 0-всегда
	U16 awRange[8];	// шкалы преобразования АЦП (мВ)
} ICR_Cfg0093, *PICR_Cfg0093, ICR_CfgAdm, *PICR_CfgAdm;

#pragma pack(pop)    

#endif // _ICR0093_H

// ****************** End of file Icr0093.h **********************
